# Pandas groupby Function

## Pandas groupby function is used to split the data into groups based on some criteria

## Syntax: DataFrame.groupby()

## groupby functions involves one of the following operations:
   ## Splitting the object
   ## Appling a function
   ## Combining the result

In [2]:
import pandas as pd

In [4]:
pd1 = pd.read_csv("D:\DATA\student_2.csv")
pd1

   Student ID  Class  Study hrs  Media hrs  Percentage
0        1001     10          2          3          50
1        1002     10          6          2          80
2        1003     10          3          2          60
3        1004     11          0          1          45
4        1005     12          5          2          75

In [6]:
gr1 = pd1.groupby(by = 'Class')
gr1

In [7]:
gr1.groups

{10: [0, 1, 2], 11: [3], 12: [4]}

In [9]:
pd1.groupby(['Class', 'Percentage']).groups

{(10, 50): [0], (10, 60): [2], (10, 80): [1], (11, 45): [3], (12, 75): [4]}

In [10]:
for Class, pd2 in gr1:
    print(Class)
    print(pd2)

10
   Student ID  Class  Study hrs  Media hrs  Percentage
0        1001     10          2          3          50
1        1002     10          6          2          80
2        1003     10          3          2          60
11
   Student ID  Class  Study hrs  Media hrs  Percentage
3        1004     11          0          1          45
12
   Student ID  Class  Study hrs  Media hrs  Percentage
4        1005     12          5          2          75

In [11]:
list(gr1)

[(10,
     Student ID  Class  Study hrs  Media hrs  Percentage
  0        1001     10          2          3          50
  1        1002     10          6          2          80
  2        1003     10          3          2          60),
 (11,
     Student ID  Class  Study hrs  Media hrs  Percentage
  3        1004     11          0          1          45),
 (12,
     Student ID  Class  Study hrs  Media hrs  Percentage
  4        1005     12          5          2          75)]

In [12]:
dict(list(gr1))

{10:    Student ID  Class  Study hrs  Media hrs  Percentage
 0        1001     10          2          3          50
 1        1002     10          6          2          80
 2        1003     10          3          2          60,
 11:    Student ID  Class  Study hrs  Media hrs  Percentage
 3        1004     11          0          1          45,
 12:    Student ID  Class  Study hrs  Media hrs  Percentage
 4        1005     12          5          2          75}

In [13]:
pd3 = pd1.groupby('Class').get_group(10)
pd3

   Student ID  Class  Study hrs  Media hrs  Percentage
0        1001     10          2          3          50
1        1002     10          6          2          80
2        1003     10          3          2          60

In [14]:
pd3 = pd1.groupby('Media hrs').get_group(2)
pd3

   Student ID  Class  Study hrs  Media hrs  Percentage
1        1002     10          6          2          80
2        1003     10          3          2          60
4        1005     12          5          2          75

In [15]:
gr1.sum()

       Student ID  Study hrs  Media hrs  Percentage
Class
10           3006         11          7         190
11           1004          0          1          45
12           1005          5          2          75

In [16]:
gr1.mean()

       Student ID  Study hrs  Media hrs  Percentage
Class
10         1002.0   3.666667   2.333333   63.333333
11         1004.0   0.000000   1.000000   45.000000
12         1005.0   5.000000   2.000000   75.000000

In [17]:
gr1.describe()

      Student ID                                                       \
           count    mean  std     min     25%     50%     75%     max
Class
10           3.0  1002.0  1.0  1001.0  1001.5  1002.0  1002.5  1003.0
11           1.0  1004.0  NaN  1004.0  1004.0  1004.0  1004.0  1004.0
12           1.0  1005.0  NaN  1005.0  1005.0  1005.0  1005.0  1005.0

      Study hrs            ... Media hrs      Percentage             \
          count      mean  ...       75%  max      count       mean
Class                      ...
10          3.0  3.666667  ...       2.5  3.0        3.0  63.333333
11          1.0  0.000000  ...       1.0  1.0        1.0  45.000000
12          1.0  5.000000  ...       2.0  2.0        1.0  75.000000


             std   min   25%   50%   75%   max
Class
10     15.275252  50.0  55.0  60.0  70.0  80.0
11           NaN  45.0  45.0  45.0  45.0  45.0
12           NaN  75.0  75.0  75.0  75.0  75.0

[3 rows x 32 columns]

In [18]:
gr1.agg(['sum','max','mean'])

      Student ID               Study hrs               Media hrs      \
             sum   max    mean       sum max      mean       sum max
Class
10          3006  1003  1002.0        11   6  3.666667         7   3
11          1004  1004  1004.0         0   0  0.000000         1   1
12          1005  1005  1005.0         5   5  5.000000         2   2

                Percentage
           mean        sum max       mean
Class
10     2.333333        190  80  63.333333
11     1.000000         45  45  45.000000
12     2.000000         75  75  75.000000